# 14 - Ultimi newspaper

In [1]:
from selenium import webdriver
from selenium.webdriver.common.keys import Keys
from selenium.webdriver.common.by import By
from selenium.webdriver.support.ui import WebDriverWait
from selenium.webdriver.support import expected_conditions as EC
from selenium.webdriver.common.action_chains import ActionChains
from time import sleep
import re
import numpy as np
import pandas as pd
from requests import get
from pandas import read_csv
from unidecode import unidecode
from bs4 import BeautifulSoup as BS
from io import StringIO

In [20]:
df = read_csv('tables/nome_nomechiave.csv')
df['nome_url'] = [x.replace(" ","+").replace("-","+").lower() for x in df.nome_chiave]
df.head()

            nome nome_chiave    nome_url
0  Kylian Mbappé      Mbappé      mbappé
1         Neymar      Neymar      neymar
2      Leo Messi       Messi       messi
3  Mohamed Salah       Salah       salah
4     Harry Kane  Harry Kane  harry+kane

# onzemondial.com

In [21]:
s1 = 'https://www.google.com/search?q='
s2 = '+site:www.gazzetta.it&source=lnms&tbm=nws'
lista_1 = [s1 + x + s2 for x in df.nome_url]
df['onzemondial_google'] = np.nan

In [ ]:
for i in range(300):
    if isinstance(df.onzemondial_google[i], float):
        url = lista_1[i]
        result = BS(get(url).text, 'lxml').select('#resultStats')[0].text
        df.loc[i, 'onzemondial_google'] = result
        print((i, df.nome[i]), end=' ')

In [32]:
l = [x.replace('About ', '').replace(' results', '').replace(',', '').replace(' result','') for x in df.onzemondial_google]
df1 = pd.DataFrame({'onzemondial_google': l})
df1.head()

  onzemondial_google
0               3670
1              13600
2              31000
3               2770
4               3290

# thesun

In [33]:
df['thesun'] = np.nan

In [34]:
s1 = "https://www.thesun.co.uk/?s="

lista_2 = [s1+x for x in df.nome_url]

In [ ]:
for i in range(300):
    if isinstance(df.thesun[i], float):
        url = lista_2[i]
        page = BS(get(url).text,'lxml')
        n_pages = page.select("div.search-result-count p")[0].text.strip().split(" ")[0].replace(",","")
        df.loc[i, 'thesun'] = n_pages
        print((i, df.nome[i]), end=' ')

In [46]:
df1['thesun'] = df.thesun

In [47]:
df1.head()

  onzemondial_google thesun
0               3670   1764
1              13600   3788
2              31000   4404
3               2770   2416
4               3290   4805

# marca.com

In [37]:
df['marca'] = np.nan

In [38]:
s1 = "https://cgi.marca.com/buscador/archivo_marca.html?q="

lista_3 = [s1+unidecode(x) for x in df.nome_url]

In [44]:
df.loc[256, 'marca'] = '0'

In [ ]:
driver = webdriver.Chrome(executable_path='chromedriver')
driver.maximize_window()

results = []

for i in range(300):
    if isinstance(df.marca[i], float):
        url = lista_3[i]
        driver.get(url)
        sleep(np.random.uniform(2))
        
        result = driver.find_element_by_class_name('porsecciones').find_element_by_tag_name('a').text
        result = re.findall(r'\d+', result)
        df.loc[i, 'marca'] = result
        print((i,df.nome[i]), end=' ')
    
driver.quit()

In [55]:
df1['marca'] = [x[0] for x in df.marca]
df1.head()

  onzemondial_google thesun  marca
0               3670   1764    571
1              13600   3788   7039
2              31000   4404  23322
3               2770   2416    457
4               3290   4805    275

# bild.de

In [56]:
s1 = 'https://www.google.com/search?q='
s2 = '+site:bild.de&source=lnms&tbm=nws'
lista_1 = [s1 + x + s2 for x in df.nome_url]
df['bild_google'] = np.nan

In [ ]:
for i in range(300):
    if isinstance(df.bild_google[i], float):
        url = lista_1[i]
        result = BS(get(url).text, 'lxml').select('#resultStats')[0].text
        df.loc[i, 'bild_google'] = result
        print((i, df.nome[i]), end=' ')

In [65]:
l = [x.replace('Ungefähr ', '').replace(' Ergebnisse', '').replace(' Ergebnis', '').replace('.', '') for x in df.bild_google]
df1['bild.de'] = l
df1.head()

  onzemondial_google thesun  marca bild.de
0               3670   1764    571    1460
1              13600   3788   7039    8230
2              31000   4404  23322    7740
3               2770   2416    457    1440
4               3290   4805    275     546

# eurosport.de

In [66]:
s1 = 'https://www.google.com/search?q='
s2 = '+site:eurosport.de&source=lnms&tbm=nws'
lista_1 = [s1 + x + s2 for x in df.nome_url]
df['eurosportDE_google'] = np.nan

In [ ]:
for i in range(300):
    if isinstance(df.eurosportDE_google[i], float):
        url = lista_1[i]
        result = BS(get(url).text, 'lxml').select('#resultStats')[0].text
        df.loc[i, 'eurosportDE_google'] = result
        print((i, df.nome[i]), end=' ')

In [71]:
l = [x.replace('Ungefähr ', '').replace(' Ergebnisse', '').replace(' Ergebnis', '').replace('.', '') for x in df.eurosportDE_google]
df1['eurosportDE_google'] = l
df1.head()

  onzemondial_google thesun  marca bild.de eurosportDE_google
0               3670   1764    571    1460                771
1              13600   3788   7039    8230              11300
2              31000   4404  23322    7740               2450
3               2770   2416    457    1440                616
4               3290   4805    275     546                371

# lequipe

In [73]:
s1 = 'https://www.google.com/search?q='
s2 = '+site:lequipe.fr&source=lnms&tbm=nws'
lista_1 = [s1 + x + s2 for x in df.nome_url]
df['lequipe_google'] = np.nan

In [ ]:
for i in range(300):
    if isinstance(df.lequipe_google[i], float):
        url = lista_1[i]
        result = BS(get(url).text, 'lxml').select('#resultStats')[0].text
        df.loc[i, 'lequipe_google'] = result
        print((i, df.nome[i]), end=' ')

In [86]:
l = [''.join(re.findall('(\d)',unidecode(x))) for x in df.lequipe_google]
df1['lequipe_google'] = l
df1.head()

  onzemondial_google thesun  marca bild.de eurosportDE_google lequipe_google
0               3670   1764    571    1460                771          45800
1              13600   3788   7039    8230              11300          57800
2              31000   4404  23322    7740               2450          52100
3               2770   2416    457    1440                616           7120
4               3290   4805    275     546                371            657

# mundodeportivo

In [87]:
s1 = 'https://www.google.com/search?q='
s2 = '+site:mundodeportivo.com&source=lnms&tbm=nws'
lista_1 = [s1 + x + s2 for x in df.nome_url]
df['mundodeportivo_google'] = np.nan

In [ ]:
for i in range(300):
    if isinstance(df.mundodeportivo_google[i], float):
        url = lista_1[i]
        result = BS(get(url).text, 'lxml').select('#resultStats')[0].text
        df.loc[i, 'mundodeportivo_google'] = result
        print((i, df.nome[i]), end=' ')

In [92]:
l = [''.join(re.findall('(\d)',unidecode(x))) for x in df.mundodeportivo_google]
df1['mundodeportivo_google'] = l
df1.head()

,onzemondial_google,thesun,marca,bild.de,eurosportDE_google,lequipe_google,mundodeportivo_google
0,3670,1764,571,1460,771,45800,3130
1,13600,3788,7039,8230,11300,57800,93100
2,31000,4404,23322,7740,2450,52100,127000
3,2770,2416,457,1440,616,7120,1500
4,3290,4805,275,546,371,657,46700

# espn

In [94]:
s1 = 'https://www.google.com/search?q='
s2 = '+site:espn.com&source=lnms&tbm=nws'
lista_1 = [s1 + x + s2 for x in df.nome_url]
df['espn_google'] = np.nan

In [ ]:
for i in range(300):
    if isinstance(df.espn_google[i], float):
        url = lista_1[i]
        result = BS(get(url).text, 'lxml').select('#resultStats')[0].text
        df.loc[i, 'espn_google'] = result
        print((i, df.nome[i]), end=' ')

In [99]:
l = [''.join(re.findall('(\d)',unidecode(x))) for x in df.espn_google]
df1['espn_google'] = l
df1.head()

,onzemondial_google,thesun,marca,bild.de,eurosportDE_google,lequipe_google,mundodeportivo_google,espn_google
0,3670,1764,571,1460,771,45800,3130,7200
1,13600,3788,7039,8230,11300,57800,93100,22800
2,31000,4404,23322,7740,2450,52100,127000,35700
3,2770,2416,457,1440,616,7120,1500,21100
4,3290,4805,275,546,371,657,46700,3980

# beinsports

In [100]:
s1 = 'https://www.google.com/search?q='
s2 = '+site:beinsports.com&source=lnms&tbm=nws'
lista_1 = [s1 + x + s2 for x in df.nome_url]
df['bein_google'] = np.nan

In [ ]:
for i in range(300):
    if isinstance(df.bein_google[i], float):
        url = lista_1[i]
        result = BS(get(url).text, 'lxml').select('#resultStats')[0].text
        df.loc[i, 'bein_google'] = result
        print((i, df.nome[i]), end=' ')

In [106]:
l = [''.join(re.findall('(\d)',unidecode(x))) for x in df.bein_google]
df1['bein_google'] = l
df1.head()

,onzemondial_google,thesun,marca,bild.de,eurosportDE_google,lequipe_google,mundodeportivo_google,espn_google,bein_google
0,3670,1764,571,1460,771,45800,3130,7200,6280
1,13600,3788,7039,8230,11300,57800,93100,22800,17300
2,31000,4404,23322,7740,2450,52100,127000,35700,20700
3,2770,2416,457,1440,616,7120,1500,21100,5140
4,3290,4805,275,546,371,657,46700,3980,2700

In [107]:
df1.to_csv('columns/last_newspaper.csv', index=False)

## eurosport.fr

In [5]:
url = 'https://docs.google.com/spreadsheets/d/1RPiYmNxy8NWKp-uu_swOkRkTuq9cqJNnzJpl5BPliDM/export?format=csv&id=1RPiYmNxy8NWKp-uu_swOkRkTuq9cqJNnzJpl5BPliDM&gid=2001946666'
r = get(url)
data = r.content.decode('utf-8')
df = pd.read_csv(StringIO(data))
df = pd.DataFrame(df[['nome_chiave']])
df['nome_url'] = [x.replace(" ","+").replace("-","+").lower() for x in df.nome_chiave]

In [6]:
s1 = 'https://www.google.com/search?q='
s2 = '+site:eurosport.fr&source=lnms&tbm=nws'
lista_1 = [s1 + x + s2 for x in df.nome_url]
df['eurosportFR'] = np.nan

In [ ]:
for i in range(300):
    if isinstance(df.eurosportFR[i], float):
        url = lista_1[i]
        result = BS(get(url).text, 'lxml').select('#resultStats')[0].text
        df.loc[i, 'eurosportFR'] = result
        if result == '':
            df.loc[i, 'eurosportFR'] = np.nan
        print((i, df.nome_chiave[i], result), end=' ')

In [11]:
l = [''.join(re.findall('(\d)',unidecode(x))) for x in df.eurosportFR]
df['eurosportFR'] = l
df.eurosportFR[df['eurosportFR'] == ''] = '1'
df[['eurosportFR']].to_csv('columns/eurosportFR.csv', index=False)